[
  "obsidian-style-settings",
  "obsidian-plugin-toc",
  "obsidian-footnotes",
  "table-editor-obsidian",
  "obsidian-pandoc",
  "obsidian-git",
  "obsidian-excalidraw-plugin",
  "calendar",
  "periodic-notes",
  "templater-obsidian",
  "obsidian-stille",
  "copy-path",
  "dataview",
  "link-favicon",
  "obsidian-list-callouts"
]