
{
  "title":"Syllabus",
  "content":" Course Meeting Times Lectures: 2 sessions / week, 1.5 hours / session\nRecitations: 1 session / week, 1 hour / session\nCourse Content The course is a comprehensive introduction to the theory, algorithms and applications of integer optimization and is organized in five parts.\nPart I Formulations, complexity and relaxations, Lectures 1-10 Discusses how to formulate integer optimization problems, how to enhance the formulations to improve the quality of relaxations, how to obtain ideal formulations, the duality of integer optimization and how to solve the resulting relaxations both practically and theoretically. It also gives insight on why integer optimization problems are difficult.\nPart II Robust discrete optimization, Lecture 11 Treats robust discrete optimization. This is a tractable methodology to address problems under uncertainty.\nPart III Algebra and geometry of integer optimization, Lectures 12-16 Develops the theory of lattices, outlines ideas from algebraic geometry that have had an impact on integer optimization, and discusses the geometry of integer optimization. These lectures provide the building blocks for developing algorithms.\nPart IV Algorithms for integer optimization, Lectures 17-23 Develops cutting plane methods, enumerative and heuristic methods and approximation algorithms.\nPart V Mixed integer optimization, Lectures 24-25 Treats mixed integer optimization. This is a practically significant area as real world problems have very often both continuous and discrete variables.\nRequired Textbook Bertsimas, Dimitris, and Robert Weismantel. Optimization over Integers. Belmont, MA: Dynamic Ideas, 2005. ISBN: 9780975914625.\nGrading Grades will be determined by performance on the following requirements. Weights are approximate, and class participation is an important tie breaker.\nACTIVITIES PERCENTAGES Homework 30% Midterm exam 30% Final exam 40% Calendar LEC # TOPICS 1 Formulations 2 Complexity 3-4 Methods to enhance formulations 5-7 Ideal formulations 8-9 Duality theory 10 Algorithms for solving relaxations 11 Robust discrete optimization 12-13 Lattices Midterm exam 14-15 Algebraic geometry 16 Geometry 17-18 Cutting plane methods 19 Enumerative methods 20 Heuristic methods 21-23 Approximation algorithms 24-25 Mixed integer optimization Final exam "}


